Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: !author has not created any blog entries.
be: !author не стварыў ніводнага запісу ў блогу.

source: !date by !username
be: !date ад !username

source: !manifest IP addresses
be: !manifest IP адрасы

source: !method @url returned @status (!length).
be: !method @url вернуты @status (!length).

source: !name (!name-url) has sent you a message via your contact form (!form-url) at !site.
be: Карыстальнік !name (!name-url) даслаў вам паведамленне праз кантактную форму (!form-url) на сайце !site.

source: !name cannot be longer than %max characters but is currently %length characters long.
be: 1 byte!name не можа быць даўжэй, чым %max знакаў, але зараз %length знакаў больш.

source: !name field is required.
be: !name – абавязковае поле.

source: !name must be a hexadecimal color value.
be: !name мусіць быць шаснаццатковым значэннем колеру.

source: !name must be a positive integer.
be: !name павінна быць станоўчым цэлым лікам.

source: !name must be an integer.
be: !name павінна быць убудаваным.

source: !name sent a message using the contact form at !form.
be: Карыстальнік !name даслаў вам паведамленне праз кантактную форму !form.

source: !name's blog
be: Блог !name

source: !sender-name (!sender-url) has sent you a message via your contact form (!form-url) at !site-name.
be: !sender-name (!sender-url) адправіў вам паведамленне праз кантактную форму (!form-url) на сайце !site-name.

source: !sender-name (!sender-url) sent a message using the contact form at !form-url.
be: !sender-імя (!sender-url) адправіў паведамленне, выкарыстоўваючы форму кантакта !form-url.

source: !site_name blogs
be: Блогі !site_name

source: !theme (administration theme)
be: !theme (Адміністрацыйная тэма)

source: !theme (default theme)
be: !theme (тэма па змаўчанні)

source: !time ago
be: !time таму

source: !title category latest items
be: Апошнія пункты катэгорыі !title

source: !title feed
be: Фід !title

source: !title feed latest items
be: Апошнія пункты фіду !title

source: !user (@email) has joined @site-name!
be: !user (@email) далучыўся да сайта @site-name!

source: !username's blog
be: Блог !username

source: "@text" found
be: "@text" знойдзены

source: "@text" not found
be: "@text" не знойдзены

source: %age old
be: %age

source: %ago ago
be: %ago таму

source: %archive_file contains versions of modules or themes that are not compatible with Drupal !version: %names
be: %archive_file утрымлівае версіі модуляў ці тэмаў, што не падтрымліваецца Drupal !version: %names

source: %archive_file does not contain any .info files.
be: Усталёўванне модуляў і тэмаў патрабуе <strong>@backends access</strong> да вашага сэрвера. Глядзіце <a href="@handbook_url">дапаможнік</a> для іншых метадаў усталёўкі.%archive_file не ўтрымлівае .info фаілаў.

source: %capital_name contains terms grouped under parent terms. You can reorganize the terms in %capital_name using their drag-and-drop handles.
be: %capital_name утрымлівае тэрміны, згрупаваныя пад зыходнымі тэрмінамі. Вы можаце рэарганізаваць тэрміны %capital_name, выкарыстаннем тэхналогіі "перацягнуў і кінуў".

source: %capital_name contains terms with multiple parents. Drag and drop of terms with multiple parents is not supported, but you can re-enable drag-and-drop support by editing each term to include only a single parent.
be: %capital_name утрымлівае тэрміны з некалькімі бацькамі (зыходнымі тэрмінамі). Тэхналогія "перацягнуў і кінуў" для тэрмінаў з мноствам бацькоў не падтрымліваецца, але вы можаце перадазволіць падтрымку магчымасці "перацягнуў і кінуў", рэдагуючы кожны тэрмін і усталёўваючы для яго толькі адзін бацькоўскі.

source: %email is not a valid e-mail address.
be: %email не дзейны адрас электроннай пошты.

source: %emails are not valid e-mail addresses.
be: %emails не з'яўляюцца сапраўднымі e-mail.

source: %field (@field_name) field requires the %widget_type widget provided by %widget_module module
be: %field (@field_name) поле патрабуе %widget_type віджэт прадстаўлены %widget_module модулем

source: %field cannot contain any markup.
be: %field не можа ўтрымліваць ніякай пазнакі.

source: %field field settings
be: Наладкі поля %field

source: %field has no field settings.
be: %field ня мае наладак поля.

source: %field may only contain characters a-z, underscores, or hyphens.
be: %field можа ўтрымліваць толькі знакі a-z, падкрэсліванні, альбо злучкі.

source: %field: There should only be one decimal separator (@separator).
be: %field: Павінен быць толькі адзін дзесятковы падзяляльнік (@separator).

source: %message in %file on line %line.
be: %message у файле %file ў радку %line.

source: %module module disabled.
be: %module модуль выключаны

source: %module module enabled.
be: %module модуль уключаны

source: %module module installed.
be: %module модуль усталяваны.

source: %module module uninstalled.
be: %module модуль дэінсталяваны.

source: %name field is required.
be: Поле %name з'яўляецца абавязковым.

source: %name has been deleted.
be: %name быў выдалены

source: %name has been disabled.
be: %name быў заблакаваны

source: %name must be a number.
be: %name павінны быць лічбай.

source: %name must be a positive integer.
be: %name павінна быць станоўчым цэлым лікам.

source: %name must be a valid hexadecimal CSS color value.
be: %name павінен быць дзейным шаснаццатковым CSS значэннем колеру.

source: %name must be an integer.
be: %name павінна быць лікавым

source: %name-from sent %name-to an e-mail.
be: Карыстальнік %name-from даслаў паведамленне e-mail карыстальніку %name-to.

source: %name-from sent an e-mail regarding %category.
be: Карыстальнік %name-from даслаў e-mail датычна %category.

source: %name: Edit any category
be: %name: Рэдагаваць любую катэгорыю

source: %name: Edit own category
be: %name: Рэдагаваць уласную катэгорыю

source: %name: illegal value.
be: %name: недазволенае значэнне.

source: %name: the summary may not be longer than %max characters.
be: %name: падсумаванне не можа быць даўжэйшым за %max сімвалаў.

source: %name: the text may not be longer than %max characters.
be: %name: тэкст не можа быць болей за %max знакаў.

source: %name: the value may be no greater than %max.
be: %name: значэнне павінна быць больш чым %max.

source: %name: the value may be no less than %min.
be: %name: значэнне павінна быць не менш за %min.

source: %name: this field cannot hold more than @count values.
be: %name: гэта поле не можа ўтрымліваць больш, чым @count значэнне(я,яў).

source: %path is a directory and cannot be removed using file_unmanaged_delete().
be: %path ёсць шлях да папкі і не можа быць выдалены з дапамогай file_unmanaged_delete().

source: %percentage of the site has been indexed.
be: %percentage сайту быў праіндэксаваны.

source: %project is already installed.
be: %project ужо ўсталяваны.

source: %property is %value
be: %property %value

source: %recipient is an invalid e-mail address.
be: %recipient ня ёсць слушным адрасам e-mail.

source: %sender-name (@sender-from) sent %recipient-name an e-mail.
be: %sender-name (@sender-from) адправіць на e-mail %recipient-name .

source: %sender-name (@sender-from) sent an e-mail regarding %category.
be: %sender-name (@sender-from) адпраўлена на e-mail адносна %category.

source: %theme is now the default theme.
be: %theme з'яўляецца зараз тэмай па змоўчанню.

source: %theme is the default theme and cannot be disabled.
be: Тэма %theme з'яўляецца стандартнай і не можа быць адключана.

source: %time ago
be: %time таму

source: %time left
be: засталося %time

source: %time ms
be: %time мс

source: %title has associated child pages, which will be relocated automatically to maintain their connection to the book. To recreate the hierarchy (as it was before removing this page), %title may be added again using the Outline tab, and each of its former child pages will need to be relocated manually.
be: Ў %title ёсць дачынныя старонкі, якія будуць занава аўтаматычна перамешчаны для падтрымання іх сувязі з кнігай. Каб пераўтварыць гіерархію (якой яна была да выдалення гэтай старонкі), магчыма дабавіць %title з дапамогай карткі Outline, і кожную яе папярэднію дачынную старонку трэба будзе занава перамясціць уручную.

source: %title has been deleted.
be: Матэрыял %title выдалены.

source: %title is part of a book outline, and has associated child pages. If you proceed with deletion, the child pages will be relocated automatically.
be: %title - гэта частка схемы кнігі з дачыненымі старонкамі. Калі вы працягнеце выдаленне - гэтыя старонкі будуць аўтаматычна перамешчаны.

source: %title may be added to hierarchy again using the Outline tab.
be: %title можа быць дададзены(а) да іерархіі зноў, выкарыстоўваючы закладку Схема.

source: %title must be a valid e-mail address
be: %title павінна быць дзеючай адрэсай электроннай пошты

source: %type is used by @count pieces of content on your site. If you remove %type, you will not be able to edit the %type content and it may not display correctly.
be: %type выкарыстоўваецца @count часткамі змесціва вашага сайта. Калі вы выдаліце гэты тып змесціва, вы не зможаце рэдагаваць тып змесціва %type і ён можа адлюстроўвацца няправільна.

source: %type settings
be: Настройкі %type

source: %type: !message in %function (line %line of %file).
be: %type: !message у %function (лінія %line у %file).

source: %type: added %title.
be: %type: дададзена %title.

source: %type_name: Create new content
be: %type_name: Стварыць новы кантэнт

source: %type_name: Delete any content
be: %type_name: Выдаліць любы кантэнт

source: %type_name: Delete own content
be: %type_name: Выдаліць уласны кантэнт

source: %type_name: Edit any content
be: %type_name: Рэдагаваць любы кантэнт

source: %type_name: Edit own content
be: %type_name: Рэдагаваць уласны кантэнт

source: %user is now using a new shortcut set called %set_name. You can edit it from this page.
be: Зараз %user выкарыстоўвае новую наладку цэтліка з імём %set_name. Вы можаце рэдагаваць яе з гэтай старонкі.

source: %user is now using the %set_name shortcut set.
be: Зараз %user выкарыстоўвае %set_name наладку цэтліка.

source: %user was added to the %newsletter mailing list.
be: Адрас %user занесены ў спісак рассылкі %newsletter.

source: '%name' block
be: Блок "%name"

source: 'Unlimited' will provide an 'Add more' button so the users can add as many values as they like.
be: 'Неабмежаваны' забяспечыць кнопкай 'Дадаць яшчэ' для таго, каб карыстальнікі маглі дадаваць столькі значэнняў, колькі пажадаюць.

source: (Machine name: @type)
be: (Імя машыны: @type)

source: (No subject)
be: (Няма тэмы)

source: (Release notes)
be: (Нататкі рэлізу)

source: (Security update)
be: (Абнаўленне сістэмы бяспекі)

source: (Theme)
be: (Тэма)

source: (Unsupported)
be: (Не падтрымліваецца)

source: (active tab)
be: (актыўны таб)

source: (built-in)
be: (убудаваны)

source: (empty)
be: (пуста)

source: (module: !module)
be: (модуль: !module)

source: (site default theme)
be: (тэма сайта па змоўчанні)

source: (version @version available)
be: (даступная @version версія)

source: - None -
be: - Нічога -

source: - None selected -
be: - Не выбрана -

source: - Please choose -
be: - Выберыце -

source: - Select -
be: 1 прагляд\r - Выбраць -

source: - Select a field type -
be: - Выбраць тып поля -

source: - Select a value -
be: - Выберыце значэнне -

source: - Select a widget -
be: - Абраць віджэт -

source: - Select an existing field -
be: - Выбраць існуючае поле -

source: -1 (Unlimited)
be: -1 (Неабмежавана)

source: -n/a-
be: 1 секунда- няма дадзеных -

source: 0 sec
be: 0 сэк.

source: 1 Hour
be: 1 Гадзіна

source: 1 comment
be: 1 камэнтар

source: 1 day
be: 1 дзень

source: 1 exception
be: 1 правалены

source: 1 fail
be: 1 пройдзены

source: 1 hour
be: 1 гадзіна

source: 1 min
be: 1 тыдзень

source: 1 month
be: 1 секунда

source: 1 new comment
be: 1 каментар

source: 1 sec
be: 1 хвіліна

source: 1 user
be: 1 карыстальнік

source: 1 week
be: 1 тыдзень

source: 1 year
be: 1 год

source: 1. Settings
be: 1. Наладкі

source: 1000 characters
be: 1000 сімвалаў

source: 1200 characters
be: 1200 сімвалаў

source: 1400 characters
be: 1400 сімвалаў

source: 1600 characters
be: 1600 сімвалаў

source: 1800 characters
be: 1800 сімвалаў

source: 2 weeks
be: 2 тыдні

source: 200 characters
be: 200 сімвалаў

source: 2000 characters
be: 2000 сімвалаў

source: 400 characters
be: 400 сімвалаў

source: 600 characters
be: 600 сімвалаў

source: 800 characters
be: 800 сімвалаў

source: < Previous Page
be: Папярэдняя старонка

source: <a href="@drupal">Drupal.org</a> offers <a href="@php-snippets">some example PHP snippets</a>, or you can create your own with some PHP experience and knowledge of the Drupal system.
be: <a href="@drupal">Drupal.org</a> прапаноўвае <a href="@php-snippets">некаторыя прыклады фрагментаў PHP</a>, або вы можаце стварыць свае ўласныя, калі маеце вопыт у PHP і ведаеце сістэму Drupal.

source: <a href="@login">Log in</a> or <a href="@register">register</a> to post comments
be: <a href="@login">Увайсці</a> ці <a href="@register">зарэгістравацца</a> для пакідання каментароў.

source: <a href="@login">Log in</a> to post comments
be: <a href="@login">Увайсці</a> для пакідання каментароў

source: <a href="@login">Log in</a> to post new content in the forum.
be: <a href="@login">Увайсці</a>, каб дадаваць новае змесціва на форум.

source: <a href="@login">Login</a> or <a href="@register">register</a> to post comments
be: <a href="@login">Увайдзіце</a> ці <a href="@register">зарэгіструйцеся</a> каб мець магчымасць пакідаць каментары.

source: <a href="@login">Login</a> to post new content in the forum.
be: <a href="@login">Увайдзіце ў сістэму</a> каб дадаваць новыя запісы ў форуме.

source: <a href="@recent-hits">Recent hits</a> displays information about the latest activity on your site, including the URL and title of the page that was accessed, the user name (if available) and the IP address of the viewer.
be: <a href="@recent-hits">Нядаўнія прагляды </a> паказвае нядаўнюю актыўнасць на вашым сайце, улічваючы URL і назву старонцы, якая праглядалася, імя карыстальніка ( калі даступна) і IP-адрас чытача.

source: <a href="@rfc4646">RFC 4646</a> compliant language identifier. Language codes typically use a country code, and optionally, a script or regional variant name. <em>Examples: "en", "en-US" and "zh-Hant".</em>
be: <a href="@rfc4646">RFC 4646</a> адпаведны ідэнтыфікатар мовы. Звычайна коды мовы выкарыстоўваюць код краіны, і, па жаданню, скрыпт альбо мясцовы варыянт назвы. <em>Прыклады: "en", "en-US" і "zh-Hant".</em>

source: <a href="@top-pages">Top pages</a> displays a list of pages ordered by how often they were viewed.
be: <a href="@top-pages">Топ старонак</a> адлюстроўвае спіс старонак упарадкаваных па колькасці праглядаў.

source: <a href="@top-referrers">Top referrers</a> displays where visitors came from (referrer URL).
be: <a href="@top-referrers">Топ пераходаў</a> адлюстроўвае адкуль прыйшлі наведвальнікі сайта (пераходныя URL).

source: <a href="@top-visitors">Top visitors</a> shows you the most active visitors for your site and allows you to ban abusive visitors.
be: <a href="@top-visitors">Топ наведвальнікаў</a> паказвае вам найболей актыўных наведвальнікаў на вашым сайце і дазваляе вам забараняць хамаў.

source: <a href="@update">Run database updates</a>
be: <a href="@update">Запуск абнаўлення базы дадзеных</a>

source: <a href="@url">Visit your new site</a>.
be: <a href="@url">Наведайце ваш новы сайт</a>.

source: <abbr title="Abbreviation">Abbrev.</abbr>
be: <abbr title="Abbreviation">Абрэв.</abbr>

source: <acronym title="Outline Processor Markup Language">OPML</acronym> is an XML format used to exchange multiple feeds between aggregators. A single OPML document may contain a collection of many feeds. Drupal can parse such a file and import all feeds at once, saving you the effort of adding them manually. You may either upload a local file from your computer or enter a URL where Drupal can download it.
be: <acronym title="Outline Processor Markup Language">OPML</acronym> - гэта XML-фармат, выкарыстоўваемы для абмену шматлікімі стужкамі (фідамі) паміж агрэгатарамі. Адзін OPML дакумент можа ўтрымліваць калекцыю з некалькіх стужак. Drupal можа парсіць такія файлы і імпартаваць усе стужкі адначасова, захоўваючы вашае намаганні дадаваць гэта уручную. Вы можаце, як закачаць лакальныя файлы з вашага кампьютэра, так і ўвесці URL, адкуль Drupal можа загрузіць іх.

source: <acronym title="Three-Letter Acronym">TLA</acronym>
be: <acronym title="Three-Letter Acronym">Трохлітаравы акронім</acronym>

source: <code>register_globals</code> is <strong>turned off</strong>. If you need to use forms, understand and use the functions in <a href="@formapi">the Drupal Form API</a>.
be: <code>register_globals</code> <strong>выключаны</strong>. Калі вам неабходна выкарыстоўваць формы, вывучыце і выкарыстоўвайце функцыі <a href="@formapi">API Drupal Формаў</a>.

source: <em>Books</em> have a built-in hierarchical navigation. Use for handbooks or tutorials.
be: <em>Кнігі</em> маюць убудаваную іерархічную навігацыю. Выкарыстоўвайце для даведнікаў і падручнікаў.

source: <em>Edit @type</em> @title
be: Вы сапраўды жадаеце выдаліць гэты элемент?<em>Рэдагаваць@type</em> @title

source: <em>Path prefix</em>: URLs like http://example.com/de/contact set language to German (de). <em>Domain</em>: URLs like http://de.example.com/contact set the language to German. <strong>Warning: Changing this setting may break incoming URLs. Use with caution on a production site.</strong>
be: <em>Прэфікс маршрута</em>: URLы, падобныя да http://example.com/de/contact, усталёўваюць мову Нямецкай (de). <em>Дамен</em>: URLы, падобныя да http://de.example.com/contact, усталёўваюць мову Нямецкай. <strong>Увага: Змена гэтай наладкі можа пашкодзіць уваходныя URLы. На працоуным сайце Ужывайце гэту наладку з асцярожнасцю.</strong>

source: <em>Roles</em> are used to group and classify users; each user can be assigned one or more roles. By default there are two roles: <em>anonymous user</em> (users that are not logged in) and <em>authenticated user</em> (users that are registered and logged in). Depending on choices you made when you installed Drupal, the installation process may have defined more roles, and you can create additional custom roles on the <a href="@roles">Roles page</a>. After creating roles, you can set permissions for each role on the <a href="@permissions_user">Permissions page</a>. Granting a permission allows users who have been assigned a particular role to perform an action on the site, such as viewing a particular type of content, editing or creating content, administering settings for a particular module, or using a particular function of the site (such as search).
be: <em>Ролі</em> выкарыстоўваюцца для аб’яднання ў групы і класіфікацыі карыстальнікаў; кожны карыстальнік можа быць прызначаны на адну або некалькі роляў.Па змаўчанні ёсць дзве ролі: <em>ананімны карыстальнік</em> (карыстальнікі, якія не ўвайшлі на сайт пад сваім нікам) і <em> пацверджаны карыстальнік </em> (карыстальнікі, які зарэгістраваліся і ўвайшлі на сайт). У залежнасці ад таго, што вы выбераце, пры ўсталёўкі Drupal, працэс усталявання можа мець значна больш роляў, і вы можаце стварыць дадатковыя асабіста наладжаныя ролі на <a href="@roles">Старонка роляў</a>. Пасля стварэння роляў, вы можаце кожнай надаць правы на \r <a href="@permissions_user">Старонка правоў</a>. Падаванне правоў дазваляе карыстальнікам, якія былі прызначаны на асаблівую ролю, выконваць розныя дзеянні на сайце, такія як: прагляд асаблівага тыпу кантэнта, змяненне і стварэнне кантэнта, адміністраванне наладак асаблівага модуля, ці выкарыстоўванне асаблівых функцый сайта (напр. пошук)

source: <em>about-us/team</em> aliased to internal path <em>node/456</em>
be: <em>node/456</em> быў прызначаны псеўданім <em>about-us/team</em>

source: <em>member/jane-smith</em> aliased to internal path <em>user/123</em>
be: <em>member/jane-smith</em> мае ўнутраны шлях <em>user/123</em>

source: <em>register_globals</em> is enabled. Drupal requires this configuration directive to be disabled. Your site may not be secure when <em>register_globals</em> is enabled. The PHP manual has instructions for <a href="http://php.net/configuration.changes">how to change configuration settings</a>.
be: <em>register_globals</em> дазволеныя. Drupal патрабуе забараніць іх. Ваш сайт не можа быць абаронены, калі <em>register_globals</em> дазволеныя. Дапаможнік PHP мае інструкцыі, <a href="http://php.net/configuration.changes">як змяніць наладкі канфігурацыі</a>.

source: <em>sub-term</em>: Country rock
be: <em>суб-тэрмін</em>: Кантры-рок

source: <em>sub-term</em>: Fusion
be: <em>sub-term</em>: Фьюжан

source: <em>sub-term</em>: Hard rock
be: <em>суб-тэрмін</em>: Хард-рок

source: <em>sub-term</em>: Swing
be: <em>sub-term</em>: Свінг

source: <em>term</em>: Jazz
be: <em>тэрмін</em>: Джаз

source: <em>term</em>: Rock
be: <em>тэрмін</em>: Рок

source: <em>vocabulary</em>: Music
be: <em>слоўнік</em>: Музыка

source: <p><em>Changing the settings below will cause the site index to be rebuilt. The search index is not cleared but systematically updated to reflect the new settings. Searching will continue to work but new content won't be indexed until all existing content has been re-indexed.</em></p><p><em>The default settings should be appropriate for the majority of sites.</em></p>
be: <p><em>Змена наладак ніжэй можа выклікаць абнаўленне індэксаў сайта. Індэкс пошуку не чысціцца, але сістэматычна абнаўляецца з улікам новых наладак. Пошук будзе працягваць працаваць, але новае змесціва не будзе індэксавацца, пакуль усё існае змесціва не будзе зноў праіндэксавана. Гэта дзеянне не можа быць адменена.</em></p><p><em>Наладкі па змаўчанні павінны падыходзіць для большасці сайтаў.</em></p>

source: <p>Add a custom block to your site, named "Welcome" . With its text format set to "PHP code" (or another format supporting PHP input), add the following in the Block body:</p> <pre> print t('Welcome visitor! Thank you for visiting.'); </pre>
be: Дадаць уласны блок на ваш сайт з імём "Сардэчна запрашаем". У яго тэкставым фармаце наладіць "PHP код" (або іншы фармат, які падтрымлівае ўвод PHP), дадаць наступнае ў цела Блока: </p>\r <pre>\r раздрукаваць ('Сардэчна запрашаем, госць! Дзякуй за наведванне.');\r </pre>

source: <p>Most unusual characters can be directly entered without any problems.</p> <p>If you do encounter problems, try using HTML character entities. A common example looks like &amp;amp; for an ampersand &amp; character. For a full list of entities see HTML's <a href="http://www.w3.org/TR/html4/sgml/entities.html">entities</a> page. Some of the available characters include:</p>
be: <p>Большасць незвычайных сымбаляў можна ўвесці наўпрост з клавіятуры без аніякіх праблем.</p>\r <p>Калі праблемы ўсё ж паўстаюць, паспрабуйце выкарыстаць сімвалы HTML. Напрыклад, каб атрымаць знак амперсанд "&amp;&copy;", пастаўце &amp;&amp;. Поўны спіс такіх падстановак ёсць <a href="http://www.w3.org/TR/html4/sgml/entities.html">ТУТ</a>. Вось некаторыя з даступных HTML-сімвалаў:</p>

source: <p>This is a one-time login for %user_name and will expire on %expiration_date.</p><p>Click on this button to log in to the site and change your password.</p>
be: Гэта аднаразовы ўваход для %user_name, які перастане працаваць %expiration_date. </p><p> Націснеце на гэту кнопку каб ўвайсці на сайт і змяніць ваш пароль.
